""" 2. Вывести строку "Hello world!" (без кавычек) в консоль."""

# print("Hello world!")


""" 3. Посмотрите на следующие переменные:
   ��то с ними не так? Как бы вы их исправили?

num = 100           # С цифры не должно начинаться
name = "Алексей"      # Думаю правильно написано
First_Number = 1     # Можно было просто написать "num"
"Мой текст" = text   # Поменять местами
"""


""" 4. Создать переменную name со значением в виде строки своего имени.
   Затем вывести строку на экран в виде: "Привет, меня зовут <имя>!" """

# name = "Denis"
# print(f"Привет, меня зовут {name}!")


""" 5. Попробуйте выполнить эту задачу разными способами.
   - Создать переменную name, значение которой определяется через ввод
   данных с клавиатуры.
   - Создать переменную surname, значение которой определяется через ввод
   данных с клавиатуры.
   - Вывести на экран строку "Привет, меня зовут <имя> <фамилия>!",
   где <имя> и <фамилия> - значения переменных name и surname соответственно. """

# name = input("Введите ваше имя: ")
# surname = input("Введите вашу фамилию: ")
# print(f"Привет, меня зовут {name} {surname}!")


""" 6. Создать переменную a, значение которой определяется через ввод
   данных с клавиатуры.
    - Создать переменную b, значение которой определяется через ввод данных
    с клавиатуры. 
    - Вывести на экран сумму двух введенных чисел, если для a было введено
    123, а для b 431, то на экран должно быть выведено 554.
 """

# a = input("Введите первое число: ")
# b = input("Введите второе число: ")
# result = int(a) + int(b)
# print(result)

